<script LANGUAGE="VBScript" RUNAT="Server" SRC="/asp/scripts/AppFlags.asp"></script>
<% ' © 2007-2016 IRTech. All rights reserved.

Dim strWhom, strWhom1, strWho
strWho = "Ученики"
strWhom1 = "ученика и его родителей"
strWhom = "учеников и родителей"
%>
<html lang="ru"><head>
<title>Пакетное обновление данных об учащихся</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<h2>Пакетное обновление данных об учащихся</h2>

<p>Пакетное обновление данных предназначено для <B>массового редактирования личных карточек учащихся</B> и позволяет редактировать практически все поля из личной карточки. Удобно, что нет необходимости входить в личную карточку каждого пользователя, 
что существенно облегчает и ускоряет этот процесс, если данные нужно отредактировать для многих пользователей.</p>

<h3>Порядок действий при пакетном обновлении данных об учащихся</h3>

<table border="0" cellpadding="0" cellspacing="0" align="left" width="100%"><tr><td width="420">
<ol>
<li>На экране <B>"Управление->Ученики->Список учеников"</B> нажмите кнопку <B>Пакетное обновление-> 1. Выгрузка данных</B>, сохраните файл формата <B>.xls</B>.
<li>Отредактируйте полученный файл в Microsoft Excel или OpenOffice Calc.
<li>Выполните команду "Сохранить как...", выберите тип файла "CSV (разделители - запятые) (*.csv)".<BR>
Файл <b>.csv</b> - это обычный текстовый файл, в котором в каждой строке перечисляются поля через разделитель. В качестве разделителя может выступать точка с запятой или запятая.
<li>Убедитесь, что вы указали верный разделитель: для этого откройте файл <b>.csv</b>, например, в стандартном "Блокноте".
<li>В системе <I><%=Application("NS_PRODUCT_NAME")%></I> на экране <B>"Управление->Ученики->Список учеников"</B> нажмите кнопку <B>Пакетное обновление-> 2. Обновление данных</B>, затем выберите сохранённый файл.
</ol>
</td><td width="420">
<img border="0" src="ImportExt/editUsers.jpg" width="420" height="218" alt="Редактирование личных карточек">
</td></tr></table>

<h3>Требования к файлу .csv для импорта</h3>
<ul>
<li>Файл <b>.csv</b> должен быть в кодировке Windows-1251.
<li>Последовательность и количество полей в файле менять нельзя.
<LI>Первые 4 строки файла - заголовочные, непосредственно в импорте они не участвуют, но количество разделителей в них всё равно должно быть правильным.
<li>Поля <B>Фамилия</B>, <B>Имя</B> и <B>Пол</B> являются обязательными.
<li><B>Пол</B> должен быть задан как М или Ж.
<li>Поля-даты (такие как&nbsp;<STRONG>Дата рождения, Дата выдачи паспорта</STRONG> и др.) должны быть в формате даты, установленном в региональных настройках программы <i><%=Application("NS_PRODUCT_NAME")%></i> (по умолчанию, д.мм.гггг).
<li>Поля не должны содержать внутри себя двойные кавычки.
<li>Поля, содержащие точки с запятой (или запятые), должны быть заключены в двойные кавычки.</li>
</ul>

<h3>Правила обработки файла импорта</h3>
<ol>
<li>Если в процессе импорта произошли ошибки, в окне 
  импорта можно увидеть cписок невведенных <%=strWhom%>. Самая распространенная причина отказа в импорте - неправильный формат записи для этого <%=strWhom1%>.<BR>Для решения проблемы скопируйте текст из раздела "неимпортированные записи" в новый файл, исправьте записи и импортируйте вновь.
<li>Существование пользователя в системе определяется 
  по его ФИО. Если с данным ФИО в системе найдено более одного пользователя с 
  данной ролью (ученик, родитель), то такая запись игнорируется, о чём выводится сообщение. Если импортируется новый пользователь, то об этом также сообщается.
<li>Поля <STRONG>Имя на экране,</STRONG> <STRONG>Имя пользователя,</STRONG> <STRONG>Пароль,</STRONG> <STRONG>Дата рождения</STRONG> никогда не изменяются при импорте.
<li>Обработка родителей происходит таким образом:
  <ul>
    <li><STRONG>1. Выгрузка данных</STRONG>: родители попадут в Excel-файл только в случае, если задано 1 или 2 родителя (причём в случае двух родителей они должны быть разного пола).</li>
    <li><STRONG>2. Обновление данных</STRONG>: если у ученика уже есть родители, то родители из Excel-файла никак не обрабатываются.</li>
  </ul>
</li>
</ol>

<h3>Особенности сохранения разных параметров</h3>
<ol>
<li>Следующие параметры <STRONG>ВСЕГДА</STRONG> берутся из 
  файла импорта, перезаписывая возможно уже существующие в системе значения этих 
  параметров для пользователя: <STRONG>Домашний телефон, Мобильный телефон, E-Mail, Сведения о паспорте</STRONG>.
<BR>Для них всегда значение берётся из файла импорта (даже если в файле импорта оно пустое, а в системе заполнено).

<li>Остальные параметры импортируются по-другому. Если 
  параметр не задан в файле импорта, то он и не обрабатывается, и в системе 
  останется старое значение этого параметра, если оно там было. Соответственно, 
  если параметр определён в файле импорта, то импорт попытается его сохранить.
                  
<li><STRONG>Наличие ПК дома, Состав семьи, Предметы для ЕГЭ, Группа здоровья, Социальное положение, Девиантное поведение, Заболевания, Физ.группа, Иностранные языки</STRONG> –
если значение для этих параметров из файла импорта находится в соответствующем справочнике, то он принимается системой и сохраняется. Иначе – такое значение параметра отправляется в комментарий. 
                  
<li>Отсюда&nbsp;<STRONG>НАСТОЯТЕЛЬНАЯ РЕКОМЕНДАЦИЯ</STRONG>&nbsp;– перед импортом 
  привести соответствующие параметры из файла импорта в соответствие 
  справочникам программы <i><%=Application("NS_PRODUCT_NAME")%></i>.
  <LI><STRONG>Заболевания, Социальное положение, Девиантное поведение, Предметы 
  для ЕГЭ</STRONG> – эти параметры могут иметь несколько значений, разделённых 
  разделителем <B>«|»</B>. </LI> 
<LI><STRONG>Адрес</STRONG> – населённый пункт для нового пользователя можно 
  задать лишь тот, в котором находится сама образовательная организация, а для 
  существующего пользователя - либо населённый пункт организации, либо оставить старый 
  населённый пункт пользователя. 
<LI><STRONG>Класс для ученика</STRONG> – ученик связывается с классом, 
  указанным в файле импорта, только если он до этого не был связан с каким-либо классом. 
  Это связано с тем, что перевод из одного класса в другой представляет собой 
  отдельный непростой процесс, выходящий за рамки импорта.</LI>
</ol>

<p><B><I>Важно!</I></B> Если среди учеников есть дети с одинаковыми ФИО, то будет создана учетная запись только для одного ученика, остальные игнорируются.</p>
<p><B><I>Важно!</I></B> Если среди учеников есть те, чьи родители имеют одинаковые ФИО,
то к каждому импортируемому ученику будут присоединены новые родители с таким ФИО.</p>

<div style="FONT-SIZE: 8pt; FONT-FAMILY: Arial,Verdana,Helvetica">© <i><%=Application("NS_PRODUCT_NAME")%></i> <%=Application("NS_VERSION")%>.<%=Application("NS_REVISION")%></div><br>
</body>
</html>
