<script LANGUAGE="VBScript" RUNAT="Server" SRC="/asp/scripts/AppFlags.asp"></script>
<% ' © 2007-2020 IRTech. All rights reserved.

Dim nRoleType, strWhom, strWhom1, strWhom2, strAboutWhom, strWho, strSchool, strClass, bAddSchool, bPreSchool
nRoleType = Request("RT")
bAddSchool = (Request("FT") = "3")
bPreSchool = (Request("FT") = "1")
If nRoleType=2 Then
  If bPreSchool Then
	strWho = "Воспитанники"
	strWhom1 = "воспитанника"
	strWhom = "воспитанников и родителей"
	strAboutWhom = "о воспитанниках и их родителях"
	strWhom2 = "воспитанников"
	strSchool = "детсада"
	strClass = "Группа"
  ElseIf bAddSchool Then
	strWho = "Ученики"
	strWhom1 = "ученика"
	strWhom = "учеников и родителей"
	strAboutWhom = "об учащихся и их родителях"
	strWhom2 = "учеников"
	strSchool = "ОДО"
	strClass = "Объединение"
  Else
	strWho = "Ученики"
	strWhom1 = "ученика"
	strWhom = "учеников и родителей"
	strAboutWhom = "об учащихся и их родителях"
	strWhom2 = "учеников"
	strSchool = "школы"
	strClass = "Класс"
  End If
Else
	strWho = "Сотрудники"
	strWhom1 = "сотрудника"
	strWhom = "сотрудников"
	strAboutWhom = "о сотрудниках"
End If
%>
<html lang="ru"><head>
<title>Импорт списка <%=strWhom%></title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<h2>Импорт списка <%=strWhom%> <%If bAddSchool Then%> (в организации дополнительного образования)<%ElseIf bPreSchool Then%> (в дошкольные организации)<%End If%></h2>

<p>Импорт позволяет заполнить практически все поля из личной карточки <%=strWhom%>. Для импорта требуется заранее подготовить файл формата <B>.xls</B>.</p>
  <h3>Порядок действий при вводе новых <%=strWhom2%> с помощью импорта</h3>
  <ol>
  <li>Сохраните на свой компьютер образец Excel-файла: 
  <ul>
    <li><B><A href="ImportExt/ImportExample_Short<%If bAddSchool Then%>_Add<%ElseIf bPreSchool Then%>_DOO<%End If%>.xls" target=_blank>краткий вариант</A></B> (удобно использовать при массовом вводе <%=strWhom2%> в начале освоения системы)
    <li><B><A href="ImportExt/ImportExample_Ext<%If bAddSchool Then%>_Add<%ElseIf bPreSchool Then%>_DOO<%End If%>.xls" target=_blank>расширенный вариант</A></B> (удобно использовать после освоения системы)
    <li><B><A href="ImportExt/ImportExample_Ino<%If bAddSchool Then%>_Add<%ElseIf bPreSchool Then%>_DOO<%End If%>.xls" target=_blank>краткий вариант для иностранных граждан</A></B> (только для случая иностранных документов, удостоверяющих личность)
  </ul>
  <li>Отредактируйте файл в Microsoft Excel или OpenOffice Calc, соблюдая "Требования к файлу для импорта" (см.ниже).
  <li>Выполните команду "Сохранить как...", выберите тип файла "Книга Excel 97-2003 (*.xls)".
  <li>В системе <I><%=Application("NS_PRODUCT_NAME")%></I> выберите "Импорт <%=strWhom2%>", затем нажмите кнопку "Добавить" и выберите сохранённый файл.
  <li>После анализа файла на экран будет выведена итоговая таблица, в которой нужно отметить галочками записи и нажать кнопку "Выбрать".
  </ol>

<h3>Требования к файлу .xls для импорта</h3>
<ul>
<li>В начале файла <b>.xls</b> может присутствовать "шапка", содержащая любые надписи для удобства работы с файлом (например, название <%=strSchool%>, фамилия ответственного и др.). "Шапка" не используется при импорте.
<li>После "шапки" должна следовать строка с названиями полей личных карточек <%=strWhom%>. Если есть вложенные поля - то названия полей могут занимать несколько строк (например, поля "Паспорт", "Адрес проживания", сведения о родителях).
  <table border="0" cellpadding="0" cellspacing="0" align="left" width="100%"><tr><td align="left">
<%If bAddSchool Then%>
  <img border="0" src="ImportExt/shapka3_add.png" width="966" height="261" alt="Структура таблицы импорта">
<%Else%>
  <img border="0" src="ImportExt/shapka3.png" width="1040" height="261" alt="Структура таблицы импорта">
<%End If%>
  </td></tr></table>
<li>Количество полей в файле может быть различным, как и порядок полей. Например, можно сохранить краткий образец файла, приведённый выше, и дополнить его полями "Дом. тел.", "Свидетельство о рождении", "СНИЛС".
<li>Требуется обязательное наличие следующих полей для <%=strWhom1%>: <B><%=strClass%></B>, <B>Фамилия</B>, <B>Имя</B>, <B>Пол</B>, <B>Дата рождения</B><%If bAddSchool Then%>, <B>Категория не зачисленных</B><%End If%>.
<li><B>Пол</B> должен быть задан как М или Ж.
<li>Ячейки, соответствующие полям-датам (например, "Дата рождения", "Дата выдачи паспорта" и др.), в Excel должны иметь формат "Дата" следующего вида: дд.мм.гггг.<%
If bAddSchool Then%>
<li>Поле <B>Категория не зачисленных</B> должно иметь одно из следующих значений: Дошкольники организованные, Дошкольники неорганизованные, Государственные школы, Частные школы, Студенты, Работающие, Прочее.<%
End If
If nRoleType<>2 Then%>
<li>В качестве <B>Роли</B> для сотрудника можно задать комбинацию из букв А, З, У, или букву Т<%
End If%>
</ul>

<h3>Правила обработки файла импорта</h3>
<ol>
<li>Если в процессе импорта произошли ошибки, появится окно со списком ошибочных записей, например:<BR>
  <table border="0" cellpadding="0" cellspacing="0" align="left" width="100%"><tr><td align="left">
  <img border="0" src="ImportExt/err3.png" width="1230" height="429" alt="Пример ошибок при импорте">
  </td></tr></table>
<B style="color:red">Красным цветом выделяются критичные ошибки</B>, которые не позволяют импортировать соответствующую строку. 
Остальные ошибки - некритичные, эти ячейки можно пропустить при импорте соответствующей строки.
<li>В окне с ошибочными записями вы можете выбрать один из вариантов действий:
<ul>
<li>Нажать кнопку <B>Отмена</B>, исправить xls-файл и импортировать его вновь. (Предварительно можно распечатать список ошибок, нажав кнопку <B>На печать</B>).
<li>Нажать кнопку <B>Продолжить</B>: чтобы она стала активной, нужно выбрать режим обработки ошибок:
<ul>
<li><B>Импортировать полностью корректные строки</B> - будут пропущены строки с любыми ошибками (критичными и некритичными).
<li><B>Импортировать полностью корректные строки и строки с некритичными ошибками</B> - будут пропущены только строки с критичными ошибками, а в остальных строках будут пропущены только ячейки с некритичными ошибками.
</ul>
</ul>
<li>Для каждого <%=strWhom1%> и его родителей при импорте будет автоматически сформировано имя пользователя (логин), который можно увидеть, нажав в экране <b><%=strWho%></b> кнопку <b>Печать</b>.
<li>Для каждого пользователя система пытается выяснить, есть ли уже такой пользователь в системе. Поиск ведётся по ФИО и дате рождения, а также по ФИО и документам, удостоверяющим личность (в случае, если в файле заданы такие документы).
<li>Поля <STRONG>Имя на экране</STRONG> и <STRONG>Логин</STRONG> принимают значение <STRONG>Фамилии</STRONG>, а <STRONG>Пароль</STRONG> = <STRONG>Фамилия</STRONG> плюс <b>уникальный код</b>, 
  который необходимо запомнить! Для новых родителей, которые импортируются из файла – перед <STRONG>Логином</STRONG> для отца добавляется <B>«О»</B>, для матери - <B>«М»</B>.
<li>После успешного импорта сотрудник, выполняющий импорт, автоматически получит почтовое сообщение, в котором будет список импортированных записей и упомянутый уникальный код.
</ol>

<h3>Особенности сохранения параметров</h3>
<ol>
<LI>Поля "Адрес проживания" и "Адрес регистрации":<BR>
<ul>
<li>если хоть одно поле по адресу заполнено, тогда требуется заполнение всех обязательных полей: "Населенный пункт", "Улица" и "Дом";
<li>населённый пункт можно задать лишь тот, в котором находится сама образовательная организация.
</ul>

<li>Некоторые поля могут иметь строго определенные значения из справочников системы (например, для <%=strWhom2%>: "Иностранные языки", "Социальное положение" и др.). 
Все несоответствия будут выведены в таблице ошибок. Возможные значения для заполнения можно просмотреть, нажав в соответствующей строке кнопку <B>Показать</B>.
<li>Отсюда <STRONG>НАСТОЯТЕЛЬНАЯ РЕКОМЕНДАЦИЯ</STRONG>: перед импортом 
  привести соответствующие параметры из файла импорта в соответствие справочникам системы <i><%=Application("NS_PRODUCT_NAME")%></i>.
  <LI>Поля "Заболевания", "Социальное положение", "Девиантное поведение", "Предметы для ЕГЭ" могут иметь несколько значений, идущих через разделитель <B>«|»</B>. </LI> 

  </ol>

<h3>Обработка записей с одинаковыми ФИО</h3>
<%If nRoleType=2 Then%>
<ul>
<li>Если в файле есть ученики с одинаковыми полями ФИО, "Дата рождения" и "<%=strClass%>", то будет создана учетная запись только для первого ученика, остальные будут отмечены как дубли (зачёркнуты на итоговом экране импорта).
<li>Если среди учеников есть те, чьи родители имеют одинаковые ФИО и дату рождения, то будет создан только один родитель с такими ФИО и датой рождения, и к нему будут присоединены все эти ученики.
</ul>
<%Else%>
<ul>
<li>Если среди сотрудников есть те, у кого одинаковые ФИО, то только один сотрудник будет создан, остальные игнорируются.
</ul>
<%End If%>
<div style="FONT-SIZE: 8pt; FONT-FAMILY: Arial,Verdana,Helvetica">© <i><%=Application("NS_PRODUCT_NAME")%></i> <%=Application("NS_VERSION")%>.<%=Application("NS_REVISION")%></div><br>
</body>
</html>
