<% ' © 2007-2014 IRTech. All rights reserved.

Dim strWhom, strWhom1, strAboutWhom, strWho
Dim nImportColNum
Dim bStudent, bAddSchool
Dim strClass

bStudent = (Request("RT") = "2")
bAddSchool = (Request("AddSchool") = "1")
If bStudent Then
	strWho = "Ученики"
	strWhom1 = "ученика и его родителей"
	strWhom = "учеников и родителей"
	strAboutWhom = "об учащихся и их родителях"
	If bAddSchool Then
		nImportColNum = 16
		strClass = "Объединение"
	Else
		nImportColNum = 15
		strClass = "Класс"
	End If
Else
	strWho = "Сотрудники"
	strWhom1 = "сотрудника"
	strWhom = "сотрудников"
	strAboutWhom = "о сотрудниках"
	nImportColNum = 7
End If
%>
<html lang="ru"><head>
<title>Импорт списка <%=strWhom%></title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<h2>Импорт списка <%=strWhom%></h2>

<p>В программе <i><%=Application("NS_PRODUCT_NAME")%></i> существует возможность ввода списка <%=strWhom%> из файла
формата <b>.csv</b> (текст с разделителем). Это очень удобно, если данные <%=strAboutWhom%> уже существуют в вашей ОО в электронном виде (например, в MS Excel или OpenOffice Calc).</p>
<p>Файл <b>.csv</b> - это обычный текстовый файл, в котором в каждой строке перечисляются поля через разделитель. В качестве разделителя может выступать точка с запятой или запятая.
Перед началом процесса импорта необходимо задать, какой именно используется разделитель.</p>

<h3>Как получить файл для импорта</h3>
<B>Чтобы получить файл для импорта из MS Excel или OpenOffice Calc</B>, создайте новый файл или воспользуйтесь имеющимся списком, оформив его в виде таблицы с <%=nImportColNum%> столбцами строго в заданной последовательности: 
<pre><%If bStudent Then%><%=strClass%>* Фамилия* Имя* Отчество Пол* Дата рождения* Ф.Отца' И.Отца' О.Отца' Д.Р.Отца' Ф.Матери' И.Матери' О.Матери' Д.Р.Матери' Комментарий<%If bAddSchool Then%> Категория*<%End If
	Else%>Фамилия* Имя* Отчество Пол* Дата рождения Роль Комментарий<%
	End If%>
</pre>
<p>Чтобы верно заполнить таблицу, предварительно прочтите раздел <B>Правила оформления файла .csv</B> ниже в тексте.<BR>
Поля, отмеченные звездочкой (*), обязательны для ввода, т.е. <%If bStudent Then%><%=strClass%>, <%End If%>Фамилия, Имя, Пол<%If bStudent Then%>, Дата рождения<%If bAddSchool Then%>, Категория<%End If%><%End If%> обязательны, а остальные поля можно оставить пустыми.<%If bStudent Then%>
<br />Сведения о родителях, помеченные апострофом ('), - необязательные, но если они вводятся, то, как и для ученика, требуется <B>обязательность</B> полей Фамилия, Имя, Дата рождения.<%End If%></p>
<p>Далее выделите границы всех <%=nImportColNum%> столбцов <%If Not bAddSchool Then%>(даже если последний столбец пустой, то и его тоже) <%End If%>как показано на рисунке:</p> 

<pre><%
	If bStudent Then
		If bAddSchool Then%><img src="/asp/SetupSchool/Spisok3d.GIF" width="1399" height="175" border="2" alt="Пример списка детей и родителей в формате Excel"><%
		Else%><img src="/asp/SetupSchool/Spisok2d.GIF" width="1140" height="140" border="2" alt="Пример списка детей и родителей в формате Excel"><%
		End If
	Else%><img src="/asp/SetupSchool/Spisok1.GIF" width="590" height="130" border="2" alt="Пример списка сотрудников в формате Excel"><%
	End If%>
</pre>
<B>Сохраните</B> полученный файл с таблицей в формате <b>.csv (разделители-запятые)</b>. Проверьте корректность созданного файла: для этого перед началом импорта откройте файл <b>.csv</b>, например, в стандартном "Блокноте".<BR><BR>

<h3>Формат файла .csv для импорта</h3>
<pre><%If bStudent Then%><%=strClass%>*; Фамилия*; Имя*; Отчество; Пол*; Дата Рождения*; Ф.Отца'; И.Отца'; О.Отца'; Д.Р.Отца'; Ф.Матери'; И.Матери'; О.Матери'; Д.Р.Матери'; Комментарий<%If bAddSchool Then%>; Категория*<%End If
	Else%>Фамилия*; Имя*; Отчество; Пол*; Дата Рождения; Роль; Комментарий<%
	End If%>
</pre>
Если в качестве разделителя используется не точка с запятой, а запятая:
<pre><%If bStudent Then%><%=strClass%>*, Фамилия*, Имя*, Отчество, Пол*, Дата Рождения*, Ф.Отца', И.Отца', О.Отца', Д.Р.Отца', Ф.Матери', И.Матери', О.Матери', Д.Р.Матери', Комментарий<%If bAddSchool Then%>, Категория*<%End If
	Else%>Фамилия*, Имя*, Отчество, Пол*, Дата Рождения, Роль, Комментарий<%
	End If%>
</pre>
<h4>Правила оформления файла .csv</h4>
<ul>
<li>Файл <b>.csv</b> должен быть в кодировке Windows-1251.
<li>Переводы строк должны быть в стиле Windows/DOS. (Если файл <b>.csv</b> готовится в Linux или MacOS, то нужно исправить переводы строк перед загрузкой в систему.)
<li>Последовательность полей - как указано выше.
<li>Количество разделителей в строке - ровно <%=(nImportColNum - 1)%>, удалите лишние, если они есть.
<li>Звездочками (*) отмечены обязательные поля.<%
If bStudent Then%>
<li>Сведения о родителях - необязательные, но если они вводятся, то, как и для ученика, требуется обязательность полей Фамилия, Имя, Дата рождения.<%
End If%>
<li><B>Пол</B> должен быть задан как М или Ж.
<li><B>Дата рождения</B> должна быть в формате даты, установленном в региональных настройках программы <i><%=Application("NS_PRODUCT_NAME")%></i> (по умолчанию, д.мм.гггг).<%
If bAddSchool Then%>
<li>Поле <B>Категория</B> должно иметь одно из следующих значений: Дошкольники организованные, Дошкольники неорганизованные, Государственные школы, Частные школы, Студенты, Работающие.<%
End If
If Not bStudent Then%>
<li>В качестве <B>Роли</B> для сотрудника можно задать комбинацию из букв А, З, У или Т. Для других ролей (психолог, мед.работник и др.) используйте букву У.<BR>
<B>Для дошкольных организаций:</B> вместо У (учитель) нужно использовать В (воспитатель).
<%
End If%>
<li>Поля не должны содержать внутри себя двойные кавычки.
</ul>
<h3>Пример правильного файла в формате .csv</h3>
<pre><%If bStudent Then
		If bAddSchool Then%>
1А Юный эколог; Петров; Алексей; Иванович; М; 19.11.1993; Петров; Иван; Михайлович; 03.08.1973; Петрова; Ирина; Васильевна; 25.02.1976; ; Дошкольники организованные
1Б Хоровой класс; Петров; Алексей; Иванович; М; 19.11.1993; Петров; Иван; Михайлович; 03.08.1973; Петрова; Ирина; Васильевна; 25.02.1976; ; Дошкольники организованные
1А Футбол; Антонов; Олег; Петрович; М; 07.12.1993; Антонов; Пётр; Борисович; 21.03.1970; Антонова; Ольга; Степановна; 04.11.1973; ; Дошкольники неорганизованные
3А Вокал; Иванова; Ксения; ; Ж; 07.01.1994; Иванов; Игорь; Петрович; 16.09.1971; ; ; ; ; ;Государственные школы
3А Вокал; Иванова; Ирина; ; Ж; 27.02.1992 ; ; ; ; ; Иванова; Елена; Семёновна; 14.04.1972; ;Частные школы
2А Футбол; Фёдоров; Роман; Павлович; М; 21.05.1991; ;;;;;;;; "Это пример комментария; если в нем есть точки с запятой, то заключите его в кавычки"; Студенты
4А Тхэквондо; Сидорова; Елена; ; Ж; 03.10.1991; Сидоров; Иван; Васильевич; 05.02.1972; Сидорова; Изольда; Викторовна; 15.06.1975; ; Работающие
		<%Else%>
5а; Петров; Алексей; Иванович; М; 19.11.1993; Петров; Иван; Михайлович; 03.08.1973; Петрова; Ирина; Васильевна; 25.02.1976;
5а; Иванова; Ксения; ; Ж; 07.01.1994; Иванов; Игорь; Петрович; 16.09.1971; ; ; ; ;
7б; Иванова; Ирина; ; Ж; 27.02.1992 ; ; ; ; ; Иванова; Елена; Семёновна; 14.04.1972;
7в; Фёдоров; Роман; Павлович; М; 21.05.1991; ;;;;;;;; "Это пример комментария; если в нем есть точки с запятой, то заключите его в кавычки"
7г; Сидорова; Елена; ; Ж; 03.10.1991; Сидоров; Иван; Васильевич; 05.02.1972; Сидорова; Изольда; Викторовна; 15.06.1975;
		<%End If
	Else%>
Иванов; Иван; Иванович; М; 29.03.69; УЗ;
Сидорова; Анна; Петровна; Ж; ; У;
Фёдоров; Роман; Павлович; М; 24.09.58; УЗА; Это пример комментария
Петрова; Зоя; Андреевна; Ж; ;; "Это пример другого комментария; если в нем есть точки с запятой, то заключите его в кавычки"
Попова; Маргарита; ; Ж; ; Т;
	<%End If%>
</pre>
<h3>Замечания</h3>
<ol>
<li>Если в процессе импорта произошли ошибки, в окне импорта можно увидеть 
cписок невведенных <%=strWhom%>. Причина, по которой это происходит - неправильный
формат записи для этого <%=strWhom1%>.<BR>Для решения проблем просто скопируйте текст из раздела "не импортированные записи" в новый файл, исправьте записи и импортируйте вновь.
<li>Для каждого <%=strWhom1%> при импорте будет автоматически сформировано имя пользователя (логин), который можно увидеть, нажав в экране <b><%=strWho%></b> кнопку <b>Печать</b>.<%If bStudent Then%>
<li><b>Отчество</b> является необязательным полем, но в целях более своевременного и полного обнаружения дублирующихся пользователей в системе - настоятельно рекомендуется вводить это поле!
<%End If%>
</ol>
<%If bStudent Then%>
<p><B><I>Важно!</I></B> <%If bAddSchool Then
	%>Одного и того же ученика можно импортировать в несколько объединений одновременно, только если эти объединения занимаются по разным программам.<%Else
	%>Если среди учеников есть ученики с одинаковыми ФИО+ДР, то только один ученик будет создан, остальные игнорируются.<%End If%>
</p>
<p><B><I>Важно!</I></B> Если среди родителей есть родители с одинаковыми ФИО+ДР, то будет создан лишь один родитель с такими ФИО+ДР, и он будет присоединён к указанным ученикам, т.е. дублирования родителей не будет.</p>
<%Else%>
<p><B><I>Важно!</I></B> Если среди сотрудников есть одинаковые ФИО, то только один сотрудник будет создан, остальные игнорируются.</p>
<%End If%>
<div style="font-size:8pt;font-family:Arial,Verdana,Helvetica">© <i><%=Application("NS_PRODUCT_NAME")%></i> <%=Application("NS_VERSION")%>.<%=Application("NS_REVISION")%></div><br>
</body>
</html>
