<% ' © 2007-2008 IRTech. All rights reserved.

Dim nRoleType, strWhom, strWhom1, strAboutWhom, strWho
Dim nParamCnt
nRoleType = Request("RT")
If nRoleType=2 Then
	strWho = "Ученики"
	strWhom1 = "ученика и его родителей"
	strWhom = "учеников и родителей"
	strAboutWhom = "об учащихся и их родителях"
	nParamCnt = 58
Else
	strWho = "Сотрудники"
	strWhom1 = "сотрудника"
	strWhom = "сотрудников"
	strAboutWhom = "о сотрудниках"
	nParamCnt = 1
End If
%>
<html lang="ru"><head>
<title>Импорт списка пользователей</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<h2>Импорт списка <%=strWhom%> из программы "1С:Хронограф Школа"</h2>

<p>Для введения в систему новых пользователей из "1С:Хронограф Школа" существует импорт из XML-файла.
 До осуществления импорта сначала необходимо произвести выгрузку данных из "1С:Хронограф Школа".
 Для этого необходимо войти в монопольном режиме  в "1С:Предприятие - 1С:Хронограф Школа". 
 При входе выбрать пользователя (например, "администратора_системы"). 
 В меню "Регламенты" выбрать пункт "Выгрузка данных в формате XML". 
 В диалоговом окне выбрать тип выгрузки данных:  "Полная выгрузка", галочка "Создавать один файл для данных и схемы"
 должна быть убрана. Задать файлы выгрузки и получить их. 
 Далее для импорта будет необходим файл с расширением XML.
 </p>
<p>Необходимо убедится, что все классы, которые есть в "1С:Хронограф Школа", созданы в ОО. Если нет, то их необходимо создать на экране "Обучение"->"Классы"->"Создание и редактирование классов".
Далее в окне списка пользователей выбрать полученный XML-файл и нажать кнопку "Импорт 1С".
 </p>

<BR>
<h3>Замечания</h3>
<ol>
<li><STRONG>НАСТОЯТЕЛЬНО 
  РЕКОМЕНДУЕТСЯ</STRONG>&nbsp; перед импортом создать все классы в школе, иначе потом будет очень трудоёмко восстанавливать связь большого количества учеников с классами.
  <LI><STRONG>Класс для ученика</STRONG> - ученик связывается с классом, 
  указанным в файле импорта, только в том случае, если он до этого не был связан с классом. 
  Это связано с тем, что перевод из одного класса в другой представляет собой 
  отдельный непростой процесс, выходящий за рамки импорта.</LI>
<li>Если в процессе импорта произошли ошибки, в окне 
  импорта можно увидеть cписок невведенных <%=strWhom%>. Самая распространенная причина отказа в импорте - неправильный формат записи для этого <%=strWhom1%>.<BR>Для решения проблемы скопируйте текст из раздела "неимпортированные записи" в новый файл, исправьте записи и импортируйте вновь.
<li>Для каждого <%=strWhom1%> при импорте будет автоматически сформировано имя пользователя (логин), который можно увидеть, нажав в экране <b><%=strWho%></b> кнопку <b>Печать</b>.
<li>Существование пользователя в системе&nbsp;определяется 
  по его ФИО. Если с данным ФИО в системе найдено более одного пользователя с 
  данной ролью (сотрудник, ученик, родитель), то такая запись игнорируется, о чём выводится сообщение. Если импортируется новый пользователь, то об этом также сообщается.
<%If nRoleType=2 Then%>
<p><B><I>Важно!</I></B> Если среди учеников есть дети с одинаковыми ФИО, то будет создана учетная запись только для одного ученика, остальные игнорируются.</p>
<p><B><I>Важно!</I></B> Если среди учеников есть те, чьи родители имеют одинаковые ФИО,
то к каждому импортируемому ученику будут присоединены новые родители с таким ФИО.</p>
<%Else%>
<p><B><I>Важно!</I></B> Если среди сотрудников есть те, у кого одинаковые ФИО, то только один сотрудник будет создан, остальные игнорируются.</p>
<%End If%>
<li>Для <STRONG>существуюших пользователей</STRONG> параметры 
  <STRONG>Имя на экране,</STRONG> <STRONG>Имя пользователя,</STRONG> 
  <STRONG>Пароль,</STRONG> <STRONG>Дата Рождения</STRONG> не изменяются.
<li>Для <STRONG>новых</STRONG> - <STRONG>Имя на экране 
  </STRONG>и<STRONG> Имя пользователя</STRONG> принимают значение 
  <STRONG>Фамилии</STRONG>, а <STRONG>Пароль</STRONG> – <STRONG>Фамилия</STRONG> 
  плюс <STRONG>случайное число</STRONG>, которое <STRONG>ОБЯЗАТЕЛЬНО</STRONG> 
  необходимо запомнить! Для <STRONG>новых родителей</STRONG>, которые импортируются из 
  файла импорта учеников – перед <STRONG>Именем пользователя</STRONG> для отца добавляется 
  «о», для матери - «м».</li>
</ol>
<h3>Особенности сохранения разных параметров</h3>
<ol>
<li>Следующие параметры <STRONG>ВСЕГДА</STRONG> берутся из 
  файла импорта, перезаписывая возможно уже существующие в системе значения этих 
  параметров для существующего в системе пользователя:&nbsp;<STRONG>Индекс, 
  Домашний телефон, E-Mail, Сведения о паспорте</STRONG>.<BR>Для них не 
  происходит никакого анализа -&nbsp;что в файле импорта значения нет, а в&nbsp;системе есть. Берётся то, что есть в файле импорта.
<li>Остальные параметры импортируются по-другому. Если 
  параметр не задан в файле импорта, то он и не обрабатывается, и в системе 
  останется старое значение этого параметра, если оно там было. Соответственно, 
  если параметр определён в файле импорта, то импорт попытается его сохранить.
<li><STRONG>Группа здоровья, Физ.группа, Заболевания (Диагноз)<!--BR, Социальное положение, Девиантное 
  поведение,Национальность, Иностранные 
  языки--></STRONG> &nbsp;-&nbsp;если значение для этих параметров&nbsp;из 
  импорта&nbsp;находится в соответствующем справочнике, то он без проблем 
  принимается системой и сохраняется.&nbsp;Иначе – 
         такое значение параметра отправляется 
  в комментарий. 
                  
<li>Отсюда&nbsp;<STRONG>НАСТОЯТЕЛЬНАЯ 
  РЕКОМЕНДАЦИЯ</STRONG>&nbsp;- перед импортом 
  привести соответствующие параметры из файла импорта в соответствие 
  справочникам программы <i><%=Application("NS_PRODUCT_NAME")%>.</i>
                  
<li>Нераспознанные системой значения параметров отправляются 
  в комментарий. 
                  
  <LI><STRONG>Адрес</STRONG> - населённый пункт для нового пользователя можно 
  задать лишь тот, в котором находится сама образовательная организация, а для 
  старого пользователя - либо населённый пункт организации, либо оставить старый 
  населённый пункт пользователя.
</ol>
<div style="FONT-SIZE: 8pt; FONT-FAMILY: Arial,Verdana,Helvetica">© <i><%=Application("NS_PRODUCT_NAME")%></i> <%=Application("NS_VERSION")%>.<%=Application("NS_REVISION")%></div><br>
</body>
</html>
