<% ' © 2007-2008 IRTech. All rights reserved.
%>
<table class="print-block" border="0" cellpadding="0" cellspacing="0" width="100%">
<tr><td colspan="2">
<div align="center">4. Сведения об обучающихся, окончивших общеобразовательное учреждение или переведенных в следующий класс в  <%=strShoolYearStart%> году</div>
<div align="right">Код по ОКЕИ: человек-792</div>
<TABLE Class="ThinTable" ALIGN="left" BORDER=1 CELLPADDING=3 CELLSPACING=0 width="100%">
<tr align="middle" valign="center">
	<td>Наименование</td>
    <td>№<br>строки</td>
	<td>4-5<br>классы</td>
	<td>6<br>класс</td>
	<td>7<br>класс</td>
	<td>8<br>класс</td>
	<td>9<br>класс</td>
	<td>10<br>класс</td>
	<td>11<br>класс</td>
	<td>12<br>класс</td>
	<td>13<br>класс</td>
	<td>14<br>класс</td>
	<td>15<br>класс</td>
	<td>16<br>класс</td>
</tr>
<tr align="middle" valign="center"><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>7</td><td>8</td><td>9</td><td>10</td><td>11</td><td>12</td><td>13</td><td>14</td></tr>
<tr align="middle" valign="center">
	<td align="left">Численность обучающихся, окончивших данный класс<br/>и переведенных в следующий класс весной, осенью</td>
	<td align="center">01</td>
	<%=DrawInputsWithTotals(1,3,14,4,Array(0))%>
</tr>
</table>
</td></tr>
<tr><td width="55%">Численность обучающихся, получивших аттестат об основном общем образовании</td><td align"left"><br>(02а)<%=IT("T040201",4,5)%></td></tr>
<tr><td>Кроме того, численность обучающихся, получивших аттестат об основном общем<br>образовании в порядке экстерната</td><td>(02б)<%=IT("T040202",4,5)%></td></tr>
<tr><td>Численность обучающихся, получивших аттестат о среднем (полном) общем образовании</td><td><br>(03а)<%=IT("T040301",4,5)%></td></tr>
<tr><td>Кроме того, численность обучающихся, получивших аттестат о среднем (полном <br>общем образовании в порядке экстерната</td><td><br>(03б)<%=IT("T040302",4,5)%></td></tr>
<tr><td>Из численности обучающихся, получивших аттестат о среднем (полном) общем образовании (стр.03а+стр. 03б):</td><td></td></tr>
<tr><td>&nbsp;&nbsp;&nbsp;&nbsp;награждены золотой медалью</td><td>(04)<%=IT("T0404",4,5)%></td></tr>
<tr><td>&nbsp;&nbsp;&nbsp;&nbsp;награждены серебряной медалью</td><td>(05)<%=IT("T0405",4,5)%></td></tr>
<tr><td>Кроме того, численность обучающихся выпускного класса, не получивших аттестат<br>о среднем (полном) общем образовании</td><td>(06)<%=IT("T0406",4,5)%></td></tr>


