<% ' © 2007-2012 IRTech. All rights reserved.
%>
<table class="print-block" border="0" cellpadding="0" cellspacing="0">
<!-- сведения об учреждении -->
<tr><td><b>Полное название и № учреждения</b><br> <%=strSchoolName%><br><br>
</td></tr>
<tr>
<td>c <%=IBArrValue("T0002",Array("очной","заочной","очной и заочной"))%>  формой обучения<br><br>
</tr></td>
<tr><td>
	<table border="0" cellpadding="0" width="100%">
	<tr><td rowspan="2" valign="top">Вид учреждения</td><td><%rw IBArrValue("T0003",Array("вечерняя(сменная) общеобразовательная школа"_
					,"учреждение для лиц с отклонениями в развитии"_
					,"вечерняя (сменная) общеобразовательная школа при ИУ"_
					,"центр образования"_
					,"открытая (сменная) общеобразовательная школа"))%></td></tr>
	<tr><td>
	вечерняя(сменная) общеобразовательная школа, учреждение для лиц<br>
	с отклонениями в развитии, вечерняя (сменная) общеобразовательная<br>
	школа при ИУ, центр образования, открытая (сменная)<br>
	общеобразовательная школа
	</td></tr>
	</table>
</td></tr>
<tr><td><%rw IBArrValue("T0004",Array("самостоятельная"_
					,"отдельные классы, организованные при дневном общеобразовательном учреждении"_
					,"УКП"))%>
<br>
указать: самостоятельная; отдельные классы, организованные при дневном общеобразо-<br>
вательном учреждении, УКП
<br><br>
</td></tr>
<tr><td>
Когда начались занятия в учреждении: число <%=IT("T0005", 3, 4 )%> месяц <%=IT("T0006", 20, 250 )%><br><br>
</td></tr>
<tr><td>
<table border="0" cellpadding="0" width="100%">
	<tr><td rowspan="2" valign="top">Когда ведутся занятия в учреждении: </td><td align="left"><%=IBArrValue("T0007",Array("днем", "вечером", "в две смены"))%> </td></tr>
	</table>
</td></tr>
<!-- end of сведения об учреждении -->
