<% ' © 2007-2008 IRTech. All rights reserved.
%>
<table class="print-block" border="0" cellpadding="0" cellspacing="0">
<tr><td align="center">
<br><br>
<!-- таб.IV -->
IV. Сведения об обучающихся, окончивших образовательное учреждение<br>
или переведенных в следующий класс в <%=strShoolYearStart%> году
<br><br>
	<div align="right">Код по ОКЕИ: человек - 792</div>
</td></tr>
<tr><td>
<TABLE Class="ThinTable" ALIGN="left" BORDER="1" CELLSPACING="0" CELLPADDING="0" width="100%">
<tr align="center" valign="middle">
	<td>Наименование</td><td>№<br>строки</td><td>4-5<br>классы</td><%dim i
		for i = 6 to 16
			response.write("<td>" & i & "<br>класс</td>")
		next%>
</tr>
<tr align="center" valign="middle"><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>7</td><td>8</td><td>9</td><td>10</td><td>11</td><td>12</td><td>13</td><td>14</td></tr>
<tr align="center" valign="middle">
	<td align="left">Численность обучающихся, окончивших данный класс и<br>переведенных в следующий класс весной или осенью</td>
	<td>01</td><%
		for i = 3 to 14
			response.write("<td>" & IT(GetOshFieldName(4, 1, i), 4, 5 ) & "</td>")
		next%>
</tr>
</TABLE>
<!-- End Of таб.IV -->
</td></tr>
<tr><td>
<br><br>Численность обучающихся, получивших аттестат об основном общем образовании	(02а) <%=IT("T0402a", 10, 5 )%>
</td></tr>
<tr><td>
<br>Кроме того численность обучающихся, получивших аттестат об основном общем образовании в порядке экстерната (02б) <%=IT("T0402b", 10, 5 )%>
</td></tr>
<tr><td>
<br>Численность обучающихся, получивших аттестат о среднем (полном) общем образовании	(03а) <%=IT("T0403a", 10, 5 )%>
</td></tr>
<tr><td>
<br>Кроме того численность обучающихся, получивших аттестат о среднем (полном) общем образовании в порядке экстерната	(03б) <%=IT("T0403b", 10, 5 )%>
</td></tr>
<tr><td>
Из численности обучающихся, получивших аттестат о среднем (полном) общем образовании (стр. 03а + стр. 03б):
</td></tr>
<tr><td>
<br>&nbsp;&nbsp;&nbsp;награждены золотой медалью (04) <%=IT("T0404", 4, 5 )%>, серебряной медалью 	(05) <%=IT("T0405", 10, 5 )%>
</td></tr>
<tr><td>
<br>Кроме того, обучающиеся выпускного класса, не получившие аттестат о среднем (полном) общем образовании 	(06) <%=IT("T0406", 10, 5 )%>
</td></tr>
<tr><td align="center">