<% ' © 2007-2008 IRTech. All rights reserved.
%>
<!-- п.I -->
<tr><td><br>
I. На каком языке или на каких языках ведется обучение в учреждении (не считая языка,<br>
который  преподается только как предмет ) - указать отдельно обучающихся на каждом языке:<br><br>
</td></tr>
<tr><td>
	<table border="0" cellpadding="0" width="90%" align="right">
	<tr><td>язык обучения</td><td><%=IT("T0101", 20, 40 )%></td></tr>
	<tr><td>численность обучающихся на данном языке</td><td>(01) <%=IT("T0102", 5, 6 )%> (чел)</td></tr>
	<tr><td>язык обучения</td><td><%=IT("T0103", 20, 40 )%></td></tr>
	<tr><td>численность обучающихся на данном языке</td><td>(02) <%=IT("T0104", 5, 6 )%> (чел)</td></tr>
	</table>
</td></tr>
<!-- end of п.I -->
<!-- п.II -->
<tr><td>
<br>II. Если учреждение имеет консультационные пункты, то указать:<br><br>
</td></tr>
<tr><td>
	<table border="0" cellpadding="0" width="90%" align="right">
	<tr><td>количество консультационных пунктов</td><td>(01) <%=IT("T0201", 3, 4 )%> (ед)</td></tr>
	<tr><td>численность обучающихся в них</td><td>(02) <%=IT("T0202", 5, 6 )%> (чел)</td></tr>
	</table>
</td></tr>
<!-- end of п.II -->
<tr><td>
<br><br>Примечание: коды по ОКЕИ: единица - 642; человек - 792
</td></tr>
</table> <!-- format -->
