$.extend( language, {
	Calendar : {
		kReplaceRoom : 'Заменить кабинет',
		kAddLesson1 : 'Добавить занятие',
		kErrMsgNotChecked : 'Нет отмеченных для удаления кабинетов',
		kMergeRoomWithHimself : 'Невозможно заменить кабинет',
		kMergeRoomsSuccess : 'Кабинет успешно заменен',
		kErrMsgEmpty : 'Введите название кабинета',
		kMsgRoomExist : 'Названия кабинетов совпадают. Для объединения кабинетов необходимо нажать кнопку "Заменить".',
		kErrorInvalidRelayLessonNum : 'Выбранная Вами "Смена/Урок" в этот день не определены!\nСм. страницу "Время занятий"',
		kNewLessonExist : 'У объединения добавляемый урок пересекается с предыдущими!',
		kAddRoom : 'Добавить Кабинет',
		kInThisClass : 'В этом объединении:',
		kDeleteRoomsWarn : 'Внимание. Удаляемые кабинеты связаны с объединениями в текущем и/или будущем учебных годах. В случае продолжения данные связи будут также удалены. Вы желаете продолжить?',
		kMergeRoomsWarn : 'Поля "Номер/название", "Этаж", "Длина (м)", "Ширина (м)", "Площадь", "Максимальная наполняемость" у заменяемого кабинета будут утеряны. Вы действительно хотите продолжить?',
		kErrorInvalidLessonNum : 'Выбранное Вами "Занятие" в этот день не определено!\nСм. страницу "Время занятий"'
	},
	ClassManagement : {
		kConfirmNoGroupsForStudent : 'Есть ученики, не включённые ни в одну подгруппу по этому предмету. Вы уверены?',
		kMsgClassChief : 'Пожалуйста, укажите руководителя объединения',
		kWarnChangeCurrPlanNotAvailableWhenFutureYearExists : '',
		kConfirmChangeCurrPlanForClass1 : '',
		kstrCASE : 'Вы уверены, что хотите ввести заглавную букву в названии объединения?'
	},
	Common : {
		kClass_es : 'объединений',
		kStudent : 'Ученик',
		kRoom : 'Кабинет',
		kStudents : 'Ученики',
		kNoRooms : 'Не задан список кабинетов',
		kClass_v : 'объединение',
		kClass_r : 'объединения',
		kStudents_r : 'учеников',
		kClass : 'Объединение'
	},
	Curriculum : {
		kClassSmall : 'объединение',
		kAddVariantPlanLesson : 'Добавить новый вариант плана занятий',
		kLessonDetails : 'Подробности занятия',
		kStudentDescrLimit : 'Примечания для учеников не должны превышать 1800 знаков',
		kLesTheme : 'Тема занятия',
		kChooseStudents : 'Выбрать учеников',
		kNoLessonInJournal1 : 'На занятие в "Журнале объединения" от',
		kNumLessonInUnit : 'Номер занятия в разделе',
		kNoStudentsInClass2 : 'В выбранном объединении нет ',
		kStudentHaveMarkForAssignment : 'У этого ученика есть оценка по данному заданию; отменить задание для него невозможно.'
	},
	Filter : {
		kNoYearClasses : 'Нет соответствующих объединений в данном году.'
	},
	Grade : {
		kCantResetChoiceCheck : 'Этому ученику уже выставлена оценка, поэтому нельзя убрать пометку "по выбору"',
		kChooseLesson : 'Выберите тему занятия',
		kLessonUsedInAnotherTerm : 'Тема занятия была использована в другом учебном периоде.\n Продолжить?',
		kTickMarkIsNecessary : 'Этому ученику уже выставлена оценка, и нельзя сделать её необязательной',
		kConfirmEmptyTKRMarks : 'У некоторых учеников не выставлена оценка за Тему.\nВы уверены, что хотите оставить клетки пустыми?'
	},
	Movement : {
		kAddStudentsToDoc : 'Добавить учеников в приказ',
		kSelectStudentsForDoc : 'Выберите студентов для приказа или нажмите на кнопку "Вернуться"',
		kStudentListLose : 'При изменении этого поля документа список набраных в приказ учеников не сохранится. Продолжить?',
		kConfirmMultiStudents : 'В приказе о переводе больше одного ученика. Вы уверены?',
		kSelectStudentsToDeleteFromDoc : 'Выберите учеников для удаления из приказа',
		kAddStudentsPrompt : 'Добавьте учеников в приказ',
		kCantMoveToSameClass : 'Объединение зачисления должно отличаться от объединения выбытия',
		kImportStudentsExt : 'Расширенный импорт учеников'
	},
	PoolStudents : {
		kConfirmEnrollUnsuitable : 'Вы зачисляете ребёнка в неподходящее объединение. Продолжить?'
	},
	Reports : {
		kCheckAidTypes : 'Пожалуйста, отметьте виды помощи ОДО',
		kNoCorrectScale : 'Настройка "Максимальная отметка" в ОДО отличается от 5.\nДанный отчет ориентирован на 5-балльную шкалу оценок и\nможет выдать некорректные результаты',
		kSendReportsToAllParents : 'Данный отчёт будет разослан всем родителям и обучающимся выбранного объединения. Каждый родитель получит информацию только о своём ребёнке. Продолжить формирование отчёта?'
	},
	SchoolSettings : {
		kErrGradesIntersect : 'Ступени объединений не должны пересекаться',
		kClasses : 'объединения',
		kInvalidGradeBounds : 'Нижняя граница объединений для ступени не может быть больше верхней'
	},
	SetupSchoolCalendar : {
		kAlertChooseClass : 'Выберите объединение',
		kRemoveSubjectWarning : 'Удаление предмета повлечет за собой удаление всех связей с объединениями, включая расписание объединений',
		kGradesHours : 'Количество часов по годам обучения',
		kMarkTeachers : 'Для сохранения пометьте нужных учителей',
		kForLimit : 'параллели',
		kSelectStudents : 'Выберите учеников или нажмите на кнопку "Вернуться"',
		kSumLimit2 : 'параллели превышает \'Предельно допустимую нагрузку\''
	},
	SetupSchoolCurPlan : {
		kConf_PlanGreaterLimit_4 : '\nОбъединение: '
	},
	SetupSchoolResources : {
		kGroupDelConfirm : 'Удаление раздела повлечет за собой удаление всех документов ОДО из этого раздела. Продолжить?'
	},
	SetupSchoolUI : {
		kDeleteStudentInfo1 : 'Внимание! Запись ученика будет удалена. Вы уверены?',
		kDeleteStudentsInfo : 'Внимание! Выбытие учеников из ОО нужно производить в "Книге движения учащихся". Вы уверены, что хотите именно удалить записи учеников?',
		kErrEditSubjects : 'Изменять преподаваемые предметы можно только для учителя',
		kDeleteParentInfo : 'Внимание: вся информация о родителе будет удалена. Если Вы хотите только отсоединить родителя от ученика, перейдите в "Сведения об ученике" и воспользуйтесь кнопкой "Отсоединить родителя".\n\nУдалить этого родителя?',
		kClassNotAssigned : 'объединение не назначено',
		kDeleteStudentInfo : 'Внимание! Выбытие обучающегося из ОДО нужно производить в "Книге движения учащихся".\nВы уверены, что хотите именно удалить запись обучающегося?',
		kMsgClassChiefUsed : 'Этот учитель является руководителем объединения, либо он преподает какие-либо предметы.\nПожалуйста, сначала переназначьте или удалите его объединения и предметы.\n\nНажмите ОК, если хотите увидеть список объединений и их руководителей.',
		kMsgTeacherUsed : 'Этот учитель является преподавателем.\nПожалуйста, сначала удалите назначенные ему предметы.\n\nНажмите ОК, если хотите увидеть список назначенных ему предметов.',
		kDeleteStudentsInfo1 : 'Внимание! Записи учеников будут удалены. Вы уверены?'
	}
});
