$.extend( language, {
	Calendar : {
		kReplaceRoom : 'Заменить кабинет',
		kAddLesson1 : 'Добавить урок',
		kErrMsgNotChecked : 'Нет отмеченных для удаления кабинетов',
		kMergeRoomWithHimself : 'Невозможно заменить кабинет',
		kMergeRoomsSuccess : 'Кабинет успешно заменен',
		kErrMsgEmpty : 'Введите название кабинета',
		kMsgRoomExist : 'Названия кабинетов совпадают. Для объединения кабинетов необходимо нажать кнопку "Заменить".',
		kErrorInvalidRelayLessonNum : 'Выбранная Вами "Смена/Урок" в этот день не определены!\nСм. страницу "Время уроков"',
		kNewLessonExist : 'У группы добавляемый урок пересекается с предыдущими!',
		kAddRoom : 'Добавить Кабинет',
		kInThisClass : 'В этом классе:',
		kDeleteRoomsWarn : 'Внимание. Удаляемые кабинеты связаны с группами в текущем и/или будущем учебных годах. В случае продолжения данные связи будут также удалены. Вы желаете продолжить?',
		kMergeRoomsWarn : 'Поля "Номер/название", "Этаж", "Длина (м)", "Ширина (м)", "Площадь", "Максимальная наполняемость" у заменяемого кабинета будут утеряны. Вы действительно хотите продолжить?'
	},
	ClassManagement : {
		kConfirmNoGroupsForStudent : 'Есть студенты, не включённые ни в одну подгруппу по этому предмету. Вы уверены?',
		kMsgClassChief : 'Пожалуйста, укажите куратора',
		kWarnChangeCurrPlanNotAvailableWhenFutureYearExists : 'Смена типа учебного плана для группы в этом году невозможна, поскольку открыто формирование будущего года',
		kConfirmChangeCurrPlanForClass1 : 'Вы уверены, что хотите изменить тип учебного плана для группы?',
		kstrCASE : 'Вы уверены, что хотите ввести заглавную букву в названии группы?'
	},
	Common : {
		kClass_es : 'групп',
		kStudent : 'Студент',
		kRoom : 'Кабинет',
		kStudents : 'Студенты',
		kNoRooms : 'Не задан список кабинетов',
		kClass_v : 'группу',
		kClass_r : 'группы',
		kStudents_r : 'студентов',
		kClass : 'Группа'
	},
	Curriculum : {
		kClassSmall : 'группа',
		kAddVariantPlanLesson : 'Добавить новый вариант плана уроков',
		kLessonDetails : 'Подробности урока',
		kStudentDescrLimit : 'Примечания для студентов не должны превышать 1800 знаков',
		kLesTheme : 'Тема урока',
		kChooseStudents : 'Выбрать студентов',
		kNoLessonInJournal1 : 'На занятие в "Журнале группы" от',
		kNumLessonInUnit : 'Номер урока в разделе',
		kNoStudentsInClass2 : 'В выбранной группе нет ',
		kStudentHaveMarkForAssignment : 'У этого студента есть оценка по данному заданию; отменить задание для него невозможно.'
	},
	Filter : {
		kNoYearClasses : 'Нет соответствующих классов в данном году.'
	},
	Grade : {
		kCantResetChoiceCheck : 'Этому студенту уже выставлена оценка, поэтому нельзя убрать пометку "по выбору"',
		kChooseLesson : 'Выберите тему урока',
		kLessonUsedInAnotherTerm : 'Тема урока была использована в другом учебном периоде.\n Продолжить?',
		kTickMarkIsNecessary : 'Этому студенту уже выставлена оценка, и нельзя сделать её необязательной',
		kConfirmEmptyTKRMarks : 'У некоторых студентов не выставлена оценка за Тему.\nВы уверены, что хотите оставить клетки пустыми?'
	},
	Movement : {
		kAddStudentsToDoc : 'Добавить студентов в приказ',
		kSelectStudentsForDoc : 'Выберите учеников для приказа или нажмите на кнопку "Вернуться"',
		kStudentListLose : 'При изменении этого поля документа список набраных в приказ студентов не сохранится. Продолжить?',
		kConfirmMultiStudents : 'В приказе о переводе больше одного студента. Вы уверены?',
		kSelectStudentsToDeleteFromDoc : 'Выберите студентов для удаления из приказа',
		kAddStudentsPrompt : 'Добавьте студентов в приказ',
		kCantMoveToSameClass : 'Группа зачисления должна отличаться от группы выбытия',
		kImportStudentsExt : 'Расширенный импорт студентов'
	},
	PoolStudents : {
		kConfirmEnrollUnsuitable : 'Вы зачисляете ребёнка в неподходящий курс. Продолжить?'
	},
	Reports : {
		kCheckAidTypes : 'Пожалуйста, отметьте виды помощи колледжу',
		kNoCorrectScale : 'Настройка "Максимальная отметка" в колледже отличается от 5.\nДанный отчет ориентирован на 5-балльную шкалу оценок и\nможет выдать некорректные результаты',
		kSendReportsToAllParents : 'Данный отчёт будет разослан всем родителям и студентам выбранной группы. Каждый родитель получит информацию только о своём ребёнке. Продолжить формирование отчёта?'
	},
	SchoolSettings : {
		kErrGradesIntersect : 'Ступени курсов не должны пересекаться',
		kClasses : 'классы',
		kInvalidGradeBounds : 'Нижняя граница курсов для ступени не может быть больше верхней'
	},
	SetupSchoolCalendar : {
		kAlertChooseClass : 'Выберите класс',
		kRemoveSubjectWarning : 'Удаление предмета повлечет за собой удаление всех связей с группами, включая расписание групп',
		kGradesHours : 'Количество часов по курсам',
		kMarkTeachers : 'Для сохранения пометьте нужных преподавателей',
		kForLimit : 'курса',
		kSelectStudents : 'Выберите студентов или нажмите на кнопку "Вернуться"',
		kSumLimit2 : 'курса превышает \'Предельно допустимую нагрузку\''
	},
	SetupSchoolCurPlan : {
		kConf_PlanGreaterLimit_4 : '\nГруппа: '
	},
	SetupSchoolResources : {
		kGroupDelConfirm : 'Удаление раздела повлечет за собой удаление всех документов колледжа из этого раздела. Продолжить?'
	},
	SetupSchoolUI : {
		kDeleteStudentInfo1 : 'Внимание! Запись студента будет удалена. Вы уверены?',
		kDeleteStudentsInfo : 'Внимание! Выбытие студентов из ОО нужно производить в "Книге движения студентов". Вы уверены, что хотите именно удалить записи студентов?',
		kErrEditSubjects : 'Изменять преподаваемые предметы можно только для преподавателя',
		kDeleteParentInfo : 'Внимание: вся информация о родителе будет удалена. Если Вы хотите только отсоединить родителя от студента, перейдите в "Сведения о студенте" и воспользуйтесь кнопкой "Отсоединить родителя".\n\nУдалить этого родителя?',
		kClassNotAssigned : 'группа не назначена',
		kDeleteStudentInfo : 'Внимание! Выбытие студента из колледжа нужно производить в "Книге движения учащихся".\nВы уверены, что хотите именно удалить запись студента?',
		kMsgClassChiefUsed : 'Этот преподаватель является куратором группы, либо он преподает какие-либо предметы.\nПожалуйста, сначала переназначьте или удалите его группы и предметы.\n\nНажмите ОК, если хотите увидеть список групп и их кураторов.',
		kMsgTeacherUsed : 'Этот преподаватель преподает предмет.\nПожалуйста, сначала удалите назначенные ему предметы.\n\nНажмите ОК, если хотите увидеть список назначенных ему предметов.',
		kDeleteStudentsInfo1 : 'Внимание! Записи студентов будут удалены. Вы уверены?'
	}
});
