$.extend( language, {
	Calendar : {
		kReplaceRoom : 'Заменить кабинет',
		kAddLesson1 : 'Добавить урок',
		kErrMsgNotChecked : 'Нет отмеченных для удаления кабинетов',
		kMergeRoomWithHimself : 'Невозможно заменить кабинет',
		kMergeRoomsSuccess : 'Кабинет успешно заменен',
		kErrMsgEmpty : 'Введите название кабинета',
		kMsgRoomExist : 'Названия кабинетов совпадают. Для объединения кабинетов необходимо нажать кнопку "Заменить".',
		kErrorInvalidRelayLessonNum : 'Выбранная Вами "Смена/Урок" в этот день не определены!\nСм. страницу "Время уроков"',
		kNewLessonExist : 'У класса добавляемый урок пересекается с предыдущими!',
		kAddRoom : 'Добавить Кабинет',
		kInThisClass : 'В этом классе:',
		kDeleteRoomsWarn : 'Внимание. Удаляемые кабинеты связаны с классами в текущем и/или будущем учебных годах. В случае продолжения данные связи будут также удалены. Вы желаете продолжить?',
		kMergeRoomsWarn : 'Поля "Номер/название", "Этаж", "Длина (м)", "Ширина (м)", "Площадь", "Максимальная наполняемость" у заменяемого кабинета будут утеряны. Вы действительно хотите продолжить?',
		kErrorInvalidLessonNum : 'Выбранный Вами "Урок" в этот день не определен!\nСм. страницу "Время уроков"'
	},
	ClassManagement : {
		kConfirmNoGroupsForStudent : 'Есть ученики, не включённые ни в одну подгруппу по этому предмету. Вы уверены?',
		kMsgClassChief : 'Пожалуйста, укажите классного руководителя',
		kWarnChangeCurrPlanNotAvailableWhenFutureYearExists : 'Смена типа учебного плана для класса в этом году невозможна, поскольку открыто формирование будущего года',
		kConfirmChangeCurrPlanForClass1 : 'Вы уверены, что хотите изменить тип учебного плана для класса?',
		kstrCASE : 'Вы уверены, что хотите ввести заглавную букву в названии группы?'
	},
	Common : {
		kClass_es : 'классов',
		kStudent : 'Ученик',
		kRoom : 'Кабинет',
		kStudents : 'Ученики',
		kNoRooms : 'Не задан список кабинетов',
		kClass_v : 'класс',
		kClass_r : 'класса',
		kStudents_r : 'учеников',
		kClass : 'Класс'
	},
	Curriculum : {
		kClassSmall : 'класс',
		kAddVariantPlanLesson : 'Добавить новый вариант плана уроков',
		kLessonDetails : 'Подробности урока',
		kStudentDescrLimit : 'Примечания для учеников не должны превышать 1800 знаков',
		kLesTheme : 'Тема урока',
		kChooseStudents : 'Выбрать учеников',
		kNoLessonInJournal1 : 'На занятие в "Классном журнале" от',
		kNumLessonInUnit : 'Номер урока в разделе',
		kNoStudentsInClass2 : 'В выбранном классе нет ',
		kStudentHaveMarkForAssignment : 'У этого ученика есть оценка по данному заданию; отменить задание для него невозможно.'
	},
	Filter : {
		kNoYearClasses : 'Нет соответствующих классов в данном году.'
	},
	Grade : {
		kCantResetChoiceCheck : 'Этому ученику уже выставлена оценка, поэтому нельзя убрать пометку "по выбору"',
		kChooseLesson : 'Выберите тему урока',
		kLessonUsedInAnotherTerm : 'Тема урока была использована в другом учебном периоде.\n Продолжить?',
		kTickMarkIsNecessary : 'Этому ученику уже выставлена оценка, и нельзя сделать её необязательной',
		kConfirmEmptyTKRMarks : 'У некоторых учеников не выставлена оценка за Тему.\nВы уверены, что хотите оставить клетки пустыми?'
	},
	Movement : {
		kAddStudentsToDoc : 'Добавить учеников в приказ',
		kSelectStudentsForDoc : 'Выберите учеников для приказа или нажмите на кнопку "Вернуться"',
		kStudentListLose : 'При изменении этого поля документа список набраных в приказ учеников не сохранится. Продолжить?',
		kConfirmMultiStudents : 'В приказе о переводе больше одного ученика. Вы уверены?',
		kSelectStudentsToDeleteFromDoc : 'Выберите учеников для удаления из приказа',
		kAddStudentsPrompt : 'Добавьте учеников в приказ',
		kCantMoveToSameClass : 'Класс зачисления должен отличаться от класса выбытия',
		kImportStudentsExt : 'Расширенный импорт учеников'
	},
	PoolStudents : {
		kConfirmEnrollUnsuitable : 'Вы зачисляете ребёнка в неподходящий класс. Продолжить?'
	},
	Reports : {
		kCheckAidTypes : 'Пожалуйста, отметьте виды помощи школе',
		kNoCorrectScale : 'Настройка "Максимальная отметка" в школе отличается от 5.\nДанный отчет ориентирован на 5-балльную шкалу оценок и\nможет выдать некорректные результаты',
		kSendReportsToAllParents : 'Данный отчёт будет разослан всем родителям и ученикам выбранного класса. Каждый родитель получит информацию только о своём ребёнке. Продолжить формирование отчёта?'
	},
	SchoolSettings : {
		kErrGradesIntersect : 'Ступени классов не должны пересекаться',
		kClasses : 'классы',
		kInvalidGradeBounds : 'Нижняя граница классов для ступени не может быть больше верхней'
	},
	SetupSchoolCalendar : {
		kAlertChooseClass : 'Выберите класс',
		kRemoveSubjectWarning : 'Удаление предмета повлечет за собой удаление всех связей с классами, включая классное расписание',
		kGradesHours : 'Количество часов по параллелям',
		kMarkTeachers : 'Для сохранения пометьте нужных учителей',
		kForLimit : 'параллели',
		kSelectStudents : 'Выберите учеников или нажмите на кнопку "Вернуться"',
		kSumLimit2 : 'параллели превышает \'Предельно допустимую нагрузку\''
	},
	SetupSchoolCurPlan : {
		kConf_PlanGreaterLimit_4 : '\nКласс: '
	},
	SetupSchoolResources : {
		kGroupDelConfirm : 'Удаление раздела повлечет за собой удаление всех школьных документов из этого раздела. Продолжить?'
	},
	SetupSchoolUI : {
		kDeleteStudentInfo1 : 'Внимание! Запись ученика будет удалена. Вы уверены?',
		kDeleteStudentsInfo : 'Внимание! Выбытие учеников из ОО нужно производить в "Книге движения учащихся". Вы уверены, что хотите именно удалить записи учеников?',
		kErrEditSubjects : 'Изменять преподаваемые предметы можно только для учителя',
		kDeleteParentInfo : 'Внимание: вся информация о родителе будет удалена. Если Вы хотите только отсоединить родителя от ученика, перейдите в "Сведения об ученике" и воспользуйтесь кнопкой "Отсоединить родителя".\n\nУдалить этого родителя?',
		kClassNotAssigned : 'класс не назначен',
		kDeleteStudentInfo : 'Внимание! Выбытие ученика из школы нужно производить в "Книге движения учащихся".\nВы уверены, что хотите именно удалить запись ученика?',
		kMsgClassChiefUsed : 'Этот учитель является классным руководителем, либо он преподает какие-либо предметы.\nПожалуйста, сначала переназначьте или удалите его классы и предметы.\n\nНажмите ОК, если хотите увидеть список классов и их руководителей.',
		kMsgTeacherUsed : 'Этот учитель является преподавателем.\nПожалуйста, сначала удалите назначенные ему предметы.\n\nНажмите ОК, если хотите увидеть список назначенных ему предметов.',
		kDeleteStudentsInfo1 : 'Внимание! Записи учеников будут удалены. Вы уверены?'
	}
});
