$.extend( language, {
	Calendar : {
		kReplaceRoom : 'Заменить помещение',
		kAddLesson1 : 'Добавить занятие',
		kErrMsgNotChecked : 'Нет отмеченных для удаления помещений',
		kMergeRoomWithHimself : 'Невозможно заменить помещение',
		kMergeRoomsSuccess : 'Помещение успешно заменено',
		kErrMsgEmpty : 'Введите название помещения',
		kMsgRoomExist : 'Названия помещений совпадают. Для объединения помещений необходимо нажать кнопку "Заменить".',
		kErrorInvalidRelayLessonNum : 'Выбранная Вами "Смена/Урок" в этот день не определены!\nСм. страницу "Время уроков"',
		kNewLessonExist : 'У группы добавляемый урок пересекается с предыдущими!',
		kAddRoom : 'Добавить Помещение',
		kInThisClass : 'В этой группе:',
		kDeleteRoomsWarn : 'Внимание. Удаляемые помещения связаны с группами в текущем и/или будущем учебных годах. В случае продолжения данные связи будут также удалены. Вы желаете продолжить?',
		kMergeRoomsWarn : 'Поля "Номер/название", "Этаж", "Длина (м)", "Ширина (м)", "Площадь", "Максимальная наполняемость" у заменяемого помещения будут утеряны. Вы действительно хотите продолжить?',
		kErrorInvalidLessonNum : 'Выбранный Вами "Урок" в этот день не определен!\nСм. страницу "Время уроков"'
	},
	ClassManagement : {
		kConfirmNoGroupsForStudent : 'Есть воспитанники, не включённые ни в одну подгруппу по этому предмету. Вы уверены?',
		kMsgClassChief : 'Пожалуйста, укажите воспитателя группы',
		kWarnChangeCurrPlanNotAvailableWhenFutureYearExists : '',
		kConfirmChangeCurrPlanForClass1 : '',
		kstrCASE : 'Вы уверены, что хотите ввести заглавную букву в названии класса?'
	},
	Common : {
		kClass_es : 'групп',
		kStudent : 'Воспитанник',
		kRoom : 'Помещение',
		kStudents : 'Воспитанники',
		kNoRooms : 'Не задан список помещений',
		kClass_v : 'группу',
		kClass_r : 'группы',
		kStudents_r : 'воспитанников',
		kClass : 'Группа'
	},
	Curriculum : {
		kClassSmall : 'группа',
		kAddVariantPlanLesson : 'Добавить новый вариант плана занятий',
		kLessonDetails : 'Подробности урока',
		kStudentDescrLimit : 'Примечания для воспитанников не должны превышать 1800 знаков',
		kLesTheme : 'Тема урока',
		kChooseStudents : 'Выбрать воспитанников',
		kNoLessonInJournal1 : 'На занятие в "Журнале группы" от',
		kNumLessonInUnit : 'Номер урока в разделе',
		kNoStudentsInClass2 : 'В выбранной группе нет ',
		kStudentHaveMarkForAssignment : 'У этого воспитанника есть оценка по данному заданию; отменить задание для него невозможно.'
	},
	Filter : {
		kNoYearClasses : 'Нет соответствующих групп в данном году.'
	},
	Grade : {
		kCantResetChoiceCheck : 'Этому воспитаннику уже выставлена оценка, поэтому нельзя убрать пометку "по выбору"',
		kChooseLesson : 'Выберите тему урока',
		kLessonUsedInAnotherTerm : 'Тема урока была использована в другом учебном периоде.\n Продолжить?',
		kTickMarkIsNecessary : 'Этому воспитаннику уже выставлена оценка, и нельзя сделать её необязательной',
		kConfirmEmptyTKRMarks : 'У некоторых воспитанников не выставлена оценка за Тему.\nВы уверены, что хотите оставить клетки пустыми?'
	},
	Movement : {
		kAddStudentsToDoc : 'Добавить воспитанников в приказ',
		kSelectStudentsForDoc : 'Выберите воспитанников для приказа или нажмите на кнопку "Вернуться"',
		kStudentListLose : 'При изменении этого поля документа список набраных в приказ воспитанников не сохранится. Продолжить?',
		kConfirmMultiStudents : 'В приказе о переводе больше одного воспитанника. Вы уверены?',
		kSelectStudentsToDeleteFromDoc : 'Выберите воспитанников для удаления из приказа',
		kAddStudentsPrompt : 'Добавьте воспитанников в приказ',
		kCantMoveToSameClass : 'Группа зачисления должна отличаться от группы выбытия',
		kImportStudentsExt : 'Расширенный импорт воспитанников'
	},
	PoolStudents : {
		kConfirmEnrollUnsuitable : 'Вы зачисляете ребёнка в неподходящую группу. Продолжить?'
	},
	Reports : {
		kCheckAidTypes : 'Пожалуйста, отметьте виды помощи детсаду',
		kNoCorrectScale : 'Настройка "Максимальная отметка" в детсаде отличается от 5.\nДанный отчет ориентирован на 5-балльную шкалу оценок и\nможет выдать некорректные результаты',
		kSendReportsToAllParents : 'Данный отчёт будет разослан всем родителям и воспитанникам выбранной группы. Каждый родитель получит информацию только о своём ребёнке. Продолжить формирование отчёта?'
	},
	SchoolSettings : {
		kErrGradesIntersect : 'Группы возрастов не должны пересекаться',
		kClasses : 'группы',
		kInvalidGradeBounds : 'Нижняя граница годов для группы возрастов не может быть больше верхней'
	},
	SetupSchoolCalendar : {
		kAlertChooseClass : 'Выберите группу',
		kRemoveSubjectWarning : 'Удаление предмета повлечет за собой удаление всех связей с группами, включая расписание групп',
		kGradesHours : 'Количество часов по годам обучения',
		kMarkTeachers : 'Для сохранения пометьте нужных воспитателей',
		kForLimit : 'года',
		kSelectStudents : 'Выберите воспитанников или нажмите на кнопку "Вернуться"',
		kSumLimit2 : 'года превышает \'Предельно допустимую нагрузку\''
	},
	SetupSchoolCurPlan : {
		kConf_PlanGreaterLimit_4 : '\nГруппа: '
	},
	SetupSchoolResources : {
		kGroupDelConfirm : 'Удаление раздела повлечет за собой удаление всех документов детсада из этого раздела. Продолжить?'
	},
	SetupSchoolUI : {
		kDeleteStudentInfo1 : 'Внимание! Запись воспитанника будет удалена. Вы уверены?',
		kDeleteStudentsInfo : 'Внимание! Выбытие воспитанников из ОО нужно производить в "Книге движения воспитанников". Вы уверены, что хотите именно удалить записи воспитанников?',
		kErrEditSubjects : 'Изменять преподаваемые предметы можно только для воспитателя',
		kDeleteParentInfo : 'Внимание: вся информация о родителе будет удалена. Если Вы хотите только отсоединить родителя от воспитанника, перейдите в "Сведения о воспитаннике" и воспользуйтесь кнопкой "Отсоединить родителя".\n\nУдалить этого родителя?',
		kClassNotAssigned : 'группа не назначена',
		kDeleteStudentInfo : 'Внимание! Выбытие воспитанника из детсада нужно производить в "Книге движения учащихся".\nВы уверены, что хотите именно удалить запись воспитанника?',
		kMsgClassChiefUsed : 'Этот воспитатель является воспитателем группы, либо он преподает какие-либо предметы.\nПожалуйста, сначала переназначьте или удалите его группы и предметы.\n\nНажмите ОК, если хотите увидеть список групп и их воспитателей.',
		kMsgTeacherUsed : 'Этот воспитатель является преподавателем.\nПожалуйста, сначала удалите назначенные ему предметы.\n\nНажмите ОК, если хотите увидеть список назначенных ему предметов.',
		kDeleteStudentsInfo1 : 'Внимание! Записи воспитанников будут удалены. Вы уверены?'
	}
});
