<% ' © 2007-2014 IRTech. All rights reserved.
%>
<!-- таб.1 -->
<table class="print-block">
<tr><td align="center">
<!-- таб.1 -->
	<b>Раздел 2. Сведения о численности и составе работников учреждений в сельской местности<br/>2.1. Общие сведения<br /></b>
	<br /><br />
	<div align="right">Код по ОКЕИ: человек-792</div>
</td></tr>
<tr><td>
<table Class="ThinTable" BORDER="1" CELLSPACING="0" CELLPADDING="0" WIDTH="100px">
<tr align="center" valign="middle">
	<!--1 column and 1-3 rows-->
	<td rowspan="3" width="400px">Наименование</td>
	<!--2 clomun and 1-3 rows-->
	<td rowspan="3">№<br/>строки</td>
	<!--3 column and 1-3 rows-->
	<td rowspan="3">Численность<br />работников<br />(физические<br/>лица)</td>
	<!--4 column and 1-3 rows-->
	<td rowspan="3">Число<br/>вакантных<br/>должностей</td>
	<!--5 clomun and 1-3 rows-->
	<td rowspan="3">Из них<br/>(из гр. 3)<br/>женщин</td>
	<!--6-12 columns-->
	<td colspan="7">Численность работников (из гр. 3),</td>
	<!-- 13-14 columns and 1-2 rows-->
	<td colspan="2" rowspan="2">кроме того, внешние<br/>совместители</td>
	<!-- 15-20 columns and 1-2 rows-->
	<td colspan="6" rowspan="2">из общей численности работников (из гр.3) имеют образование</td>
	<!-- 21-25 columns and 1-2 rows-->
	<td colspan="5" rowspan="2">из общей численности работников (из гр.3) имеют стаж работы</td>
	<!-- 26-30 columns and 1-2 rows-->
	<td colspan="5" rowspan="2">из общей численности работников (из гр.3) находятся в возрасте (число<br/>полных лет на отчетную дату)</td>
</tr>
<tr align="center" valign="middle"><td colspan="2">имеющих</td>
	<!--8 column and 2-3 rows-->
	<td rowspan="2">имеющих<br/>внутреннее<br/>совмести-<br/>тельство</td>
	<!-- 9-12 columns-->
	<td colspan="4">имеющих квалификацию</td>
	
</tr>
<tr align="center" valign="middle">
	<!--6 column-->
	<td>неполную<br/>занятость</td>
	<!--7 column-->
	<td>полную<br/>занятость</td>
	<!--9 column-->
	<td>высшей<br/>категории</td>
	<!--10 column-->
	<td>первой<br/>категории</td>
	<!--11 column-->
	<td>второй<br/>категории</td>
	<!--12 column-->
	<td>не имеют<br/>категории</td>
	<!--13 column-->
	<td>всего</td>
	<!--14 column-->
	<td>из них<br/>женщины</td>
	<!--15 column-->
	<td>высшее<br/>профес-<br/>сиональное</td>
	<!--16 column-->
	<td>из них (из<br/>гр.15) педаго-<br/>гическое</td>
	<!--17 column-->
	<td>среднее<br/>профес-<br/>сиональное</td>
	<!--18 column-->
	<td>из них (из<br/>гр.17) педаго-<br/>гическое</td>
	<!--19 column-->
	<td>начальное<br/>профес-<br/>сиональное</td>
	<!--20 column-->
	<td>среднее<br/>(полное)<br/>общее</td>
	<!--21 column-->
	<td>менее 2 лет</td>
	<!--22 column-->
	<td>от 2 до 5 лет</td>
	<!--23 column-->
	<td>от 5 до 10 лет</td>
	<!--24 column-->
	<td>от 10 до 20 лет</td>
	<!--25 column-->
	<td>от 20 лет и более</td>
	<!--26 column-->
	<td>моложе 25 лет</td>
	<!--27 column-->
	<td>25-35 лет</td>
	<!--28 column-->
	<td>35 лет и<br/>старше</td>
	<!--29 column-->
	<td>из них (из гр.<br/>28) пенси-<br/>онеров</td>
	<!--30 column-->
	<td>из них<br/>(из гр.29)<br/>женщины</td>
</tr>
<%

Dim arrRows
arrRows = Array(_
Array("Всего работников учреждения (сумма строк 02, 07, 38, 40)",1),_
"в том числе<br/>  руководящие работники (сумма строк 03-06)",_
"    в том числе<br/>      директор",_
"      заместители директора",_
"      главный бухгалтер",_
"      другие руководящие работники",_
"  педагогические работники (сумма строк 08, 29-35)",_
"    в том числе:<br/>      учителя (сумма строк 09-28)",_
"        в том числе:<br/>          1-4 и подготовительных классов",_
"          русского языка и литературы",_
"          нерусского языка и литературы",_
"          истории, права, обществознания, экономики",_
"          математики",_
"          информатики",_
"          физики",_
"          химии",_
"          географии",_
"          биологии",_
"          английского языка",_
"          немецкого языка",_
"          французского языка",_
"          других иностранных языков",_
"          музыки и пения",_
"          изобразительного искусства, черчения",_
"          основ безопасности жизнедеятельности",_
"          физической культуры",_
"          трудового обучения",_
"          прочих предметов",_
"      учителя-логопеды",_
"      мастера производственного обучения",_
"      педагоги-психологи",_
"      социальные педагоги",_
"      воспитатели",_
"      тьюторы",_
"      другие педагогические работники",_
"    из них (из стр. 07):<br/>      педагогический персонал, работающий в специальных<br/>      (коррекционных) классах для детей с ограниченными<br/>      возможностями здоровья",_
"    из них (из стр. 07):<br/>      педагогический персонал, получающий надбавки за<br/>      работу с детьми с ограниченными возможностями<br/>      здоровья, обучающимися в обычных классах",_
"  учебно-вспомогательный персонал",_
"    из них (из стр. 07 и 38):<br/>      педагогический и учебно-вспомогательный персонал,<br/>      работающий с дошкольными группами",_
"  обслуживающий персонал"_
)

Call DrawFormRows(arrRows, 30, "02.1")
%>

</table>
<table class="filterTable">
<tr><td><br/><br/><b>Справка к разделу 2.1</b><br/></td></tr>

<!--41 row-->
<tr>
<td>Численность медицинских работников<br/>(сумма строк 43, 44)(чел)<br/></td>
<td>(41) <%=ITS("T02.141", 4, 5)%></td>
</tr>

<!--42 row-->
<tr>
<td>&nbsp;&nbsp;из них женщин (чел)<br/></td>
<td>(42) <%=IT("T02.142", 4, 5 )%></td>
</tr>

<!--43 row-->
<tr>
<td>&nbsp;&nbsp;&nbsp;&nbsp;в том числе<br/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;врачи всех специальностей (чел)<br/></td>
<td>(43) <%=IT("T02.143", 4, 5)%></td>
</tr>

<!--44 row-->
<tr>
<td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;медицинские сестры (чел)<br/></td>
<td>(44) <%=IT("T02.144", 4, 5)%></td>
</tr>

<!--45 row-->
<tr>
<td>Численность учителей в возрасте до 30 лет (из строки 08)(чел)<br/></td>
<td>(45) <%=IT("T02.145", 4, 5 )%></td>
</tr>

<!--46 row-->
<tr>
<td>Численность руководителей, прошедших в течение последних трех<br/>лет повышение квалификации и (или) профессиональную<br/>переподготовку (из строки 02) (чел)</td>
<td>(46) <%=IT("T02.146", 4, 5 )%></td>
</tr>
</table>
</td></tr></table>
<!-- end of таб.1 -->

