<!-- #INCLUDE VIRTUAL="/asp/EDUC_MANAGER/Reports/StatForms/RIK83/Form83_inc.asp" -->
<% ' © 2007-2015 IRTech. All rights reserved.

'Данный файл служит для хранение специфики данной ревизии формы
'В данном случае это листание страницы
'TODO. описать ввиде списка

Function GetFormPages()
	GetFormPages = Array("", "Титульный лист:", "п.1.1:", "п.1.2:", "п.1.3:", "п.1.4:", "п.1.5:", "п.1.6:", "п.1.7:", "п.1.8:", "п.1.9:", "п.1.10:", "п.1.11:",_
	"п.2.1:", "п.2.2:", "п.2.3:", "п.2.4:", "п.2.5:", "п.2.6:", "п.2.7:", "п.2.8:", "п.2.9:", "п.2.10:", "п.2.11:", "п.3:", "п.4:")
End Function
%>